tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Cross-platform make
brew "cmake"

# GNU File, Shell, and Text utilities
# "These are the core utilities which are expected to exist on every operating system"
# e.g. echo, chroot, kill, whoami, tee, touch, cat, ...
brew "coreutils"

# C++ library for machine learning
# needed for some python ML libraries
brew "dlib"

# "Pack, ship and run any application as a lightweight container"
brew "docker", link: false

# Modern replacement for 'ls'
brew "exa"

# CLI tool for quick access to files and directories
brew "fasd"

# Collection of GNU find, xargs, and locate
brew "findutils"

# Command-line fuzzy finder
brew "fzf"

# Distributed revision control system
brew "git"

# Tool to build, change, and version infrastructure
# a.k.a. infrastructure as code
brew "hashicorp/tap/terraform"

# Kubernetes package manager
brew "helm"

# Improved colored git diff
brew "icdiff"

# Kubernetes command-line interface
brew "kubernetes-cli"

# Asynchronous event library
brew "libev"

# LLVM's OpenMP runtime library
brew "libomp"

# Postgres C API library
brew "libpq"

# Mac App Store command-line interface
brew "mas"

# Run a Kubernetes cluster locally
brew "minikube"

# Parser generator tool and incremental parsing library
# used in Neovim for better syntax highlighting
brew "tree-sitter"

# _the_ terminal text editor
brew "vim"

# Only the best IDE there is
brew "neovim"

# JavaScript runtime
brew "node"

# OCaml package manager
brew "opam"

# Object-relational database system
brew "postgresql"

# Python version management
brew "pyenv"

# Global python version used for some tools like `awk`
brew "python@3.9"

# line-oriented search tool: https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# Encrypt/decrypt using SSH keys
brew "ssh-vault"

# A fast code searching tool
brew "the_silver_searcher"

# The best terminal multiplexer there is
brew "tmux"

# Internet file retriever
brew "wget"

# General-purpose data compression with high compression ratio
brew "xz"

# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# lossless data-compression library
brew "zlib"

# Web browser focusing on privacy
cask "brave-browser"

# Web browser
cask "firefox"

# Google's web browser
cask "google-chrome"

# HTTP and GraphQL Client
cask "insomnia"

# Terminal emulator
cask "iterm2"

# Raycast lets you control your tools with a few keystrokes.
cask "raycast"

# Team communication and collaboration software
cask "slack"

# Move and resize windows with ease
cask "spectacle"

# Music streaming service
cask "spotify"

# Desktop client for WhatsApp
cask "whatsapp"

# Open-source version of the X.Org X Window System
cask "xquartz"

mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
