tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "kreuzwerker/taps"
tap "railwaycat/emacsmacport"
tap "universal-ctags/universal-ctags"
tap "warrensbox/tap"
brew "xz"
brew "gcc"
brew "grpc"
brew "openblas"
brew "apache-arrow"
brew "aws-iam-authenticator"
brew "gettext"
brew "cmake"
brew "colima"
brew "coreutils"
brew "diffutils"
brew "dive"
brew "dlib"
brew "docker"
brew "docker-compose"
brew "exa"
brew "findutils"
brew "fzf"
brew "git"
brew "gnu-getopt"
brew "graphviz"
brew "helm"
brew "helmfile"
brew "htop"
brew "icdiff"
brew "jpeg"
brew "jq"
brew "jsonnet"
brew "jsonnet-bundler"
brew "k6"
brew "kubernetes-cli"
brew "lapack"
brew "libev"
brew "libomp"
brew "libpq"
brew "llvm"
brew "mas"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "opam"
brew "openjdk"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "redis"
brew "ripgrep"
brew "sops"
brew "ssh-vault"
brew "telnet"
brew "terraform"
brew "terragrunt"
brew "tflint"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "yarn"
brew "zlib"
brew "zplug"
brew "zsh-syntax-highlighting"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/boundary"
brew "hashicorp/tap/vault"
brew "kreuzwerker/taps/m1-terraform-provider-helper"
brew "warrensbox/tap/tfswitch"
brew "warrensbox/tap/tgswitch"
cask "emacs-mac"
cask "firefox"
cask "google-chrome"
cask "marta"
cask "postman"
cask "slack"
cask "spectacle"
cask "spotify"
cask "whatsapp"
cask "xquartz"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
