tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
tap "warrensbox/tap"
brew "aws-iam-authenticator"
brew "bash"
brew "bat"
brew "xz"
brew "python@3.9"
brew "cmake"
brew "cookiecutter"
brew "coreutils"
brew "diffutils"
brew "dive"
brew "dlib"
brew "docker", link: false
brew "exa"
brew "fasd"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "graphviz"
brew "helm"
brew "helmfile"
brew "hugo"
brew "icdiff"
brew "jq"
brew "jsonnet"
brew "jsonnet-bundler"
brew "k3d"
brew "krb5"
brew "kubernetes-cli"
brew "libev"
brew "libomp"
brew "libpq"
brew "mas"
brew "minikube"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "opam"
brew "perl"
brew "postgresql"
brew "pyenv"
brew "python-yq"
brew "ripgrep"
brew "sops"
brew "ssh-vault"
brew "terragrunt"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "wget"
brew "zlib"
brew "zsh-syntax-highlighting"
brew "derailed/k9s/k9s"
brew "warrensbox/tap/tfswitch"
cask "alacritty"
cask "brave-browser"
cask "dbvisualizer"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "marta"
cask "postman"
cask "r"
cask "raycast"
cask "robo-3t"
cask "slack"
cask "spectacle"
cask "spotify"
cask "whatsapp"
cask "xquartz"
